1s/ERP/Conf/Documents/Лико_ЗаявкаНаИзготовлениеФорм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ЗаявкаНаИзготовлениеФорм</Name>
			<BasedOn>
				<xr:Item>Catalog.Лико_Формы</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Лико_ИсторияДвиженийФорм</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Полимер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_ОбъектыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаПолимера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаПолимера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЛистов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовленияПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовленияФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ВидыОперацийИзготвленияФорм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолщинаПластины</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Растр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправлена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Формы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Форма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Формы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Длина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ширина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоваяФорма</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаПеределки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_УглыПоворотаРастра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_УглыПоворотаРастра</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦвета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ТипыЦвета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ЗаявкаНаИзготовлениеФорм/Ext/ManagerModule.bsl
#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	//// Задание складскому работнику
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "ПечатьДокумента";
	//КомандаПечати.Представление = НСтр("ru = 'Печать документа'");
	//КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	////КомандаПечати.СразуНаПринтер = Истина;	
	//
	
	
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПечатьДокумента") Тогда
		
		//УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		//	КоллекцияПечатныхФорм,
		//	"ПечатьДокумента",
		//	НСтр("ru = 'ПечатьДокумента'"),
		//	ПечатьЗадания(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
КонецПроцедуры

Функция ПечатьЗадания(МассивОбъектов, ОбъектыПечати)
	
КонецФункции
#КонецОбласти


#Область Отчеты

/// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	//ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
	//--> Маковеева А.Ю.
	//ВариантыОтчетовУТПереопределяемый.ДобавитьКомандуДвиженияДокумента(КомандыОтчетов);
	//<-- Маковеева А.Ю.
	
КонецПроцедуры

#КонецОбласти


#Область Прочее

#КонецОбласти

Функция ОпределениеРазмераПолимера(Заказ) Экспорт
	Структура = Новый Структура;
	Структура.Вставить("Длина",0);
	СТруктура.Вставить("Ширина",0);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Лико_ПараметрыШтампа.Номенклатура,
	|	Лико_ПараметрыШтампа.ТипШтампа,
	|	Лико_ПараметрыШтампа.ЭтикетокНаЛисте,
	|	Лико_ПараметрыШтампа.Нарезка Как ширинаРулона,
	|	Лико_ПараметрыШтампа.ШагПечати,
	|	Лико_ПараметрыШтампа.Ручьи,
	|	Лико_ПараметрыШтампа.РучьиМин,
	|	Лико_ПараметрыШтампа.Z,
	|	Лико_ПараметрыШтампа.ДлинаЭтикетки,
	|	Лико_ПараметрыШтампа.ШиринаЭтикетки,
	|	Лико_ПараметрыШтампа.ДлинаКонтрЭтикетки,
	|	Лико_ПараметрыШтампа.ДлинаКольеретки,
	|	Лико_ПараметрыШтампа.ШиринаКонтрЭтикетки,
	|	Лико_ПараметрыШтампа.ШиринаКольеретки,
	|	Лико_ПараметрыШтампа.НаправлениеНамотки,
	|	Лико_ПараметрыШтампа.Цена,
	|	Лико_ПараметрыШтампа.ПорядковыйНомерШтанцыНаВалу,
	|	Лико_ПараметрыШтампа.ШиринаПоНожам,
	|	Лико_ПараметрыШтампа.ИнтервалМеждуРучьями,
	|	Лико_ПараметрыШтампа.ИнтервалМеждуЭтикетками,
	|	Лико_ПараметрыШтампа.ШагПоНарезке,
	|	Лико_ПараметрыШтампа.ШагПоРаппорту,
	|	Лико_ПараметрыШтампа.Артикул,
	|	Лико_ПараметрыШтампа.Материал,
	|	Лико_ПараметрыШтампа.ИмяФайлаЧертежа,
	|	Лико_ПараметрыШтампа.Комментарий
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
	|		ПО ЗаказКлиента.ШтампВырубной = Лико_ПараметрыШтампа.Номенклатура
	|ГДЕ
	|	ЗаказКлиента.Ссылка = &Заказ";
	Запрос.УстановитьПараметр("Заказ",Заказ );
	
	
	РезультатЗапроса = Запрос.Выполнить();
	ПараметрыШтампа = РезультатЗапроса.Выбрать();
	Пока ПараметрыШтампа.Следующий() Цикл
		
		Нарезка=ПараметрыШтампа.ШиринаРулона.Размер;
		Если ЗначениеЗаполнено(ПараметрыШтампа.Z) Тогда
			Раппорт=ПараметрыШтампа.Z.КоличествоЗубьев * 3.175;
			Дистроция=1-6.265/(раппорт + 3.14);
			Структура.Ширина = Раппорт*Дистроция + 10;  
			Структура.Длина = Нарезка+2;
			
			//		Структура.Длинна= (ПараметрыШтампа.Z.КоличествоЗубьев*3.175/10+0.025);
			//		Структура.Ширина=?(ПараметрыШтампа.ШиринаПоНожам=0,(Нарезка+0.02),ПараметрыШтампа.ШиринаПоНожам)/10; //По два миллиметра по краям
		Иначе 
			Если ЗначениеЗаполнено(ПараметрыШтампа.ШагПечати) Тогда			
				Структура.Ширина =ПараметрыШтампа.ШагПечати*1000+10;
				СТруктура.Длина=Нарезка+2;
			КонецЕсли;
		КонецЕсли;       
		
		
		
		
		
	КонецЦикла; 
	
	Возврат Структура;
	
КонецФункции


// Запись в форму угла поворота растра по умолчанию
//
// Описание:
//
//
// Параметры Форма- СпрвочникСсылка.Лико_Формы - 
//
Процедура ЗаписатьУголПоворотаРастра(Форма) Экспорт 
	ФормаОбъект=Форма.ПолучитьОбъект();
	УголПоворотаПоУмолчанию=Справочники.Лико_УглыПоворотаРастра.НайтиПоРеквизиту("ТипЦвета",ФормаОбъект.ТипЦвета);
	Если ЗначениеЗаполнено(УголПоворотаПоУмолчанию) Тогда
		ФормаОбъект.УголПоворотаРастра=УголПоворотаПоУмолчанию;
	Иначе
		ФормаОбъект.УголПоворотаРастра=Справочники.Лико_УглыПоворотаРастра.K;
	КонецЕсли;
	
	
	ФормаОбъект.Записать();
КонецПроцедуры //ЗаписатьУголПоворотаРастра
